In [1]:
import pandas as pd

In [5]:
eleves = pd.read_csv('eleve_2022.csv')

In [10]:
eleves.head()

,Classe,Destinataires,Entretien 1,Entretien 2,Entretien 3
0,301,ALVES COSTA Diego,Metiers de l'automobile,Metiers de l'entreprise,Metiers scientifiques
1,301,ARGUENON Lilian,Metiers de l'alimentation,Metiers de l'automobile,Metiers du commerce
2,301,BERNASCONI Luka,Metiers de l'automobile,Metiers scientifiques,Metiers de l'informatique
3,301,BORGARD Thomas,Metiers de l'entreprise,Metiers scientifiques,Metiers de l'informatique
4,301,BRAULT Leo,Metiers de l'enseignement,Metiers scientifiques,Metiers de la communication

In [11]:
parents = pd.read_csv('parent_2022.csv')

In [12]:
parents.head()

   Unnamed: 0                    Domaine            Intervenant Unnamed: 3
0         NaN          Chef d’entreprise          BARRE Barbara        NaN
1         NaN          Chef d’entreprise      BALLOT Jean-Clair        NaN
2         NaN  Metiers Banque et Finance          DUBOIS Andrea        NaN
3         NaN  Metiers Banque et Finance  RAZANAJAO Miharintsoa        NaN
4         NaN  Metiers Banque et Finance        CHARLET Vincent        NaN